Revit 2027 API
LayoutRuleFixedDistance.Spacing Property
Get or set spacing of the Beam System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Spacing { get; set; }
Public Property Spacing As Double
	Get
	Set
public:
property double Spacing {
	double get ();
	void set (double value);
}
member Spacing : float with get, set
Property Value
Double
Remarks
The value of spacing must be between 0 and 30000.
See Also
Reference
LayoutRuleFixedDistance Class
Autodesk.Revit.DB Namespace